Repository: 2448986301/AggieGPA
Catalog: AggieGPA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Transfer Credit
zh_hans: 转学分

source: Try a course calculation without changing your records
zh_hans: 试算课程成绩，不会改动你的记录

source: Try a different search or academic year.
zh_hans: 请尝试其他搜索内容或学年。

source: Try a GPA forecast
zh_hans: 试算 GPA

source: Try another filter or add a due date to an assignment or exam.
zh_hans: 可以更换筛选条件，或为作业和考试补充截止日期。

source: Try Demo
zh_hans: 体验示例

source: Try Siri
zh_hans: 试用 Siri

source: Try: “What assignments are due this week?”, “What is my course grade?”, or “Draft an assignment.”
zh_hans: 试试：“这周有哪些作业到期？”，“我的课程成绩是多少？”，或“创建作业草稿。”

source: Type
zh_hans: 类型

source: UC Davis
zh_hans: 加州大学戴维斯分校

source: Unassigned
zh_hans: 未分类

source: Undergraduate repeat replacement is estimated for up to 16 units. When a repeated course crosses that limit, Aggie GPA includes both attempts in the estimate and flags the result for review.
zh_hans: 本科重复修读替换按最多 16 学分估算。若重复课程超过这一上限，Aggie GPA 会将两次成绩都纳入估算并提示你核对。

source: Undo
zh_hans: 撤销

source: Undo removes all items created in this batch.
zh_hans: 撤销会移除此批次创建的全部项目。

source: Undo restores the assignment and its recorded score.
zh_hans: 撤销后会恢复作业及已记录的分数。

source: Ungraded and missing work
zh_hans: 未评分和缺交任务

source: Ungraded work is excluded from the current grade, not counted as zero.
zh_hans: 未评分项目不会计入当前成绩，也不会被当作 0 分。

source: Ungraded work stays out of current-grade calculations
zh_hans: 未评分项目不会计入当前成绩计算

source: Units
zh_hans: 学分

source: University policies and program requirements can change. Use Aggie GPA to plan, then verify important decisions with official university records.
zh_hans: 学校政策和项目要求可能变化。请使用 Aggie GPA 进行规划，并通过学校的正式记录核对重要决定。

source: Unknown
zh_hans: 未知

source: Unlock
zh_hans: 解锁

source: Unnamed category
zh_hans: 未命名类别

source: Unofficial student tool. Not affiliated with U C Davis.
zh_hans: 非官方学生工具，与 UC Davis 无隶属关系。

source: Unofficial student tool. Not affiliated with UC Davis.
zh_hans: 非官方学生工具，与 UC Davis 无隶属关系。

source: Up to five small JSON snapshots are retained on this device. A snapshot is created before imports and resets.
zh_hans: 设备上最多保留 5 个小型 JSON 快照；导入或重置前会先创建快照。

source: Upcoming
zh_hans: 待完成

source: Upcoming Assignments
zh_hans: 近期作业

source: Upcoming Exams
zh_hans: 近期考试

source: Upper-Division
zh_hans: 高年级课程

source: Upper-division course
zh_hans: 高年级课程

source: Use a Template
zh_hans: 使用模板

source: Use all eligible courses or choose a smaller scope
zh_hans: 使用所有符合条件的课程，或选择更小的范围

source: Use common scale template
zh_hans: 使用常见分数线模板

source: Use Current
zh_hans: 使用当前成绩

source: Use Enhanced Model Only While Charging
zh_hans: 仅在充电时使用 Enhanced 模型

source: Use Manual Rule Recognition
zh_hans: 改用本地规则识别

source: Use my records
zh_hans: 使用我的记录

source: Use short names you naturally say. Separate aliases with commas.
zh_hans: 输入你平时会说的简称，并用逗号分隔。

source: Use This Model
zh_hans: 使用此模型

source: Use This Template
zh_hans: 使用此模板

source: Use What-If scenarios and target calculations without changing official records.
zh_hans: 使用 GPA 试算和目标计算，不会修改正式记录。

source: Uses selected course forecast scenarios only where no official grade exists. Official GPA above is unchanged.
zh_hans: 仅对尚无正式成绩的课程使用所选预测方案，上方正式 GPA 不会改变。

source: Using %@ instead of %@. %@
zh_hans: 改用%@，替代%@。%@

source: Using a partial result for manual review
zh_hans: 正在使用部分结果供手动审核

source: Using a smaller local model because available memory is limited.
zh_hans: 由于可用内存有限，正在使用较小的本地模型。

source: Using a smaller local model because Low Power Mode is on.
zh_hans: 由于已开启低电量模式，正在使用较小的本地模型。

source: Using a smaller local model because the device is warm.
zh_hans: 由于设备温度较高，正在使用较小的本地模型。

source: Using a smaller local model until the device is charging.
zh_hans: 设备接通电源前，正在使用较小的本地模型。

source: Using the on-device Apple Intelligence model
zh_hans: 正在使用设备端 Apple 智能模型

source: Using the selected local model.
zh_hans: 正在使用已选择的本地模型。

source: Verify official records
zh_hans: 核对正式记录

source: Version
zh_hans: 版本

source: Version %@
zh_hans: 版本 %@

source: Version %@ (Build %@)
zh_hans: 版本 %@（构建 %@）

source: Version History
zh_hans: 历史版本

source: Very Hot
zh_hans: 过热

source: View Academic Calendar
zh_hans: 查看学业日历

source: View Academic Timeline
zh_hans: 查看学业时间线

source: View All
zh_hans: 查看全部

source: View All Assignments & Exams
zh_hans: 查看全部作业与考试

source: View Full Breakdown
zh_hans: 查看完整成绩构成

source: View Full Release Notes
zh_hans: 查看完整更新日志

source: View Full Simulation
zh_hans: 查看完整模拟

source: View GPA journey
zh_hans: 查看 GPA 变化

source: View Saved Plans
zh_hans: 查看已保存计划

source: View Source
zh_hans: 查看原文依据

source: Warm
zh_hans: 偏热

source: Week
zh_hans: 周

source: Weight
zh_hans: 权重

source: Weight %
zh_hans: 权重 %

source: Weight percent
zh_hans: 权重百分比

source: Weight total
zh_hans: 权重合计

source: Weighted categories
zh_hans: 类别加权

source: Weighted Categories
zh_hans: 按类别加权

source: Weighted categories, assignments, exams, and score entry
zh_hans: 加权类别、作业、考试和分数录入

source: Weighted category
zh_hans: 类别加权

source: Weights do not total 100%. This is a partial setup, so final results may be misleading.
zh_hans: 权重合计不是 100%。当前设置尚不完整，最终结果可能具有误导性。

source: What Do I Need?
zh_hans: 我还需要多少分

source: What matters today?
zh_hans: 今天最重要的事

source: What this app cannot decide
zh_hans: 本 App 无法决定的事项

source: What-If
zh_hans: 成绩模拟

source: What-If changes stay separate until you explicitly choose Save to Records.
zh_hans: 在你明确选择“保存到正式记录”前，试算调整都会与正式记录分开。

source: What-If GPA
zh_hans: GPA 试算

source: What-If Playground
zh_hans: 成绩试算

source: What’s New
zh_hans: 更新内容

source: Which course?
zh_hans: 选择课程

source: Which quarter?
zh_hans: 哪个学期？

source: Why This Grade?
zh_hans: 为什么是这个成绩？

source: Winter
zh_hans: 冬季

source: Worst possible
zh_hans: 最差结果

source: Worth %@ of course
zh_hans: 占课程总评 %@

source: You can edit the details before confirming.
zh_hans: 确认前可以编辑这些细节。

source: You can enable Face ID later in Settings.
zh_hans: 你可以稍后在设置中开启 Face ID。

source: You can keep this sheet open while we prepare the preview.
zh_hans: 预览正在准备中，你可以先停留在此页面。

source: You can paste text and create the grading method manually. OCR is not used.
zh_hans: 你可以粘贴文本并手动建立评分方式；不会使用 OCR。

source: You can restore it without losing the recorded score.
zh_hans: 恢复后不会丢失已记录的分数。

source: You can use manual grading setup and local rule recognition without downloading a language model.
zh_hans: 无需下载语言模型，也可以使用手动评分设置和本地规则识别。

source: You control exported backups. Deleting the app can remove local data, so keep a backup before changing devices. Face ID, Touch ID, and passcode checks are performed by iOS; Aggie GPA never receives biometric information.
zh_hans: 导出的备份由你自行管理。删除 App 可能会移除本地数据，更换设备前请保留备份。Face ID、Touch ID 和密码验证均由 iOS 执行；Aggie GPA 不会接收生物识别信息。

source: You do not need to create a Shortcut. Try: “What assignments are due this week in Aggie GPA?”, “What is my current grade in CHE 002A?”, or “Open CHE 002A.”
zh_hans: 无需创建快捷指令。你可以试着说：“Aggie GPA，这周有哪些作业到期？”“我在 CHE 002A 的当前成绩是多少？”或“打开 CHE 002A。”

source: You’re all caught up.
zh_hans: 近期没有待办事项。

source: Your academic records stay on this device. Aggie GPA has no account, advertising, analytics tracking, remote logging, or cloud sync.
zh_hans: 你的学业记录保存在这台设备上。Aggie GPA 没有账号、广告、分析追踪、远程日志或云同步。

source: Your data needs attention
zh_hans: 你的数据需要处理

source: Your data stays on this iPhone
zh_hans: 你的数据只留在这台 iPhone

source: Your GPA
zh_hans: 你的 GPA

source: Your GPA path
zh_hans: 你的 GPA 路径

source: Your recorded score stays unchanged until you tap Save.
zh_hans: 点击“保存”前，已记录的成绩不会改变。

source: Your target
zh_hans: 你的目标

source: Your target has been reached
zh_hans: 已达到你的目标

source: Your target is not mathematically reachable
zh_hans: 从数学上无法达到你的目标

source: Your target remains reachable
zh_hans: 仍有可能达到你的目标

source: First Release
zh_hans: 首个正式版本

source: The first complete release of Aggie GPA, a native iPhone and iPad academic planning app.
zh_hans: Aggie GPA 的首个完整版本，一款原生 iPhone 和 iPad 学业规划 App。

source: Aggie GPA keeps optional on-device AI behind a provider boundary. The verified llama.cpp runtime runs on this device; inference begins only when you choose a local model.
zh_hans: Aggie GPA 将可选的设备端 AI 保持在 Provider 边界之后。经过验证的 llama.cpp 运行时在本机运行；只有选择本地模型后才会开始推理。

source: Choose from the available local model sizes in On-Device Intelligence. Models are downloaded only when you request them and remain on this device.
zh_hans: 在“设备端智能”中选择可用的本地模型大小。模型仅在你主动请求时下载，并保留在本机。
